test/data/transactionsValidation/calculatorCollectionItemsMissing.json

[{
  "id": "d15dbad2-a5d2-4c96-9a9c-5f794d3eba01",
  "name": "Add",
  "request": {
    "description": {
      "content": "Adds two integers. This is a test WebService. ©DNE Online",
      "type": "text/plain"
    },
    "url": {
      "path": ["calculator.asmx"],
      "host": "http://www.dneonline.com",
      "query": [],
      "variable": []
    },
    "header": [{
      "key": "Content-Type",
      "value": "text/xml; charset=utf-8"
    }],
    "method": "POST",
    "body": {
      "mode": "raw",
      "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>100</intA\n      <intB>100</intB>\n    </Add>\n  </soap:Body>\n</soap:Envelope>\n",
      "options": {
        "raw": {
          "language": "xml"
        }
      }
    }
  },
  "response": [{
    "id": "0b710935-f1f7-4048-9ea8-ce829a477eab",
    "name": "Add response",
    "originalRequest": {
      "url": {
        "protocol": "http",
        "path": ["calculator.asmx"],
        "host": ["www", "dneonline", "com"],
        "query": [],
        "variable": []
      },
      "header": [{
        "key": "Content-Type",
        "value": "text/xml; charset=utf-8"
      }],
      "method": "POST",
      "body": {
        "mode": "raw",
        "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>100</intA\n      <intB>100</intB>\n    </Add>\n  </soap:Body>\n</soap:Envelope>\n",
        "options": {
          "raw": {
            "language": "xml"
          }
        }
      }
    },
    "status": "OK",
    "code": 200,
    "header": [{
      "key": "Content-Type",
      "value": "text/xml; charset=utf-8"
    }],
    "body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <AddResponse xmlns=\"http://tempuri.org/\">\n      <AddResult>100</AddResult>\n    </AddResponse>\n  </soap:Body>\n</soap:Envelope>\n",
    "cookie": [],
    "_postman_previewlanguage": "xml"
  }],
  "event": []
}
]
